[
    {
        "id": "9c8b16e9-0fd2-4890-bd23-3170fe6f7e62",
        "title": "Three people killed in Lebanon strike , including Hezbollah commander",
        "date": "2024-04-08T09:15:00+00:00",
        "url": "https://english.palinfo.com/news/2024/04/08/317099/",
        "message": "BEIRUT, (PIC)Three people were killed in an overnight Israeli air strike in Lebanon, including a Hezbollah commander.\nLebanon’s official National News Agency reported that Israeli aircraft “raided an inhabited house” in Sultaniyeh, reporting “three martyrs and a number of wounded”.\nIt said the strike caused “huge damage” to nearby buildings and infrastructure and that at least 10 families were affected.\nMeanwhile, a Lebanese security source told AFP that “a local commander from (Hezbollah’s) Radwan unit” was killed in the Israeli strike along with two other members of the group.\nThe source, speaking on condition of anonymity, identified the commander as Abbas Jaafar.",
        "classification": "security",
        "score": 0.9857246012289841
    },
    {
        "id": "a88bb676-28d4-4ff5-a512-7a779730c4b4",
        "title": "Iran general killed by Israel strike in Syria was on Hezbollah top council : Report",
        "date": "2024-04-08T15:30:00+00:00",
        "url": "https://www.firstpost.com/world/iran-general-killed-by-israel-strike-in-syria-was-on-hezbollahs-top-council-report-13757574.html",
        "message": "AdvertisementAmong them was Mohammad Reza Zahedi, a top commander in the Guards’ international operations division, the Quds Force.\nZahedi was the only non-Lebanese on Hezbollah’s eight-member Shura Council, the equivalent of the powerful Shiite Muslim movement’s political bureau, led by secretary general Hassan Nasrallah, the source said, requesting anonymity because the matter is sensitive.\nNasrallah was set to speak on Monday to pay homage to Zahedi and his colleagues killed in the strike, which Tehran and Damascus have blamed on Israel.\nIn a previous speech, Nasrallah said his group “owed a lot” to the senior Iranian official.\nTehran has promised to respond to the strike, which killed 16 people including two civilians, according to the Syrian Observatory for Human Rights, a monitor of Syria’s years-long civil war.",
        "classification": "security",
        "score": 0.7092477203880907
    },
    {
        "id": "070741e6-89d3-4b7c-8376-547862594797",
        "title": "Hezbollah field commander killed in southern Lebanon",
        "date": "2024-04-08T07:00:00+00:00",
        "url": "https://www.albawaba.com/news/hezbollahs-field-commander-killed-southern-lebanon-1560711",
        "message": "ALBAWABA - Israeli airstrikes on southern Lebanon left at least three people killed, Reuters reported citing two security sources.\nAccording to Reuters, a field commander of Hezbollah’s elite forces Al Radwan was among those killed in an attack on the Sultanya village in southern Lebanon.\nOn Sunday, Hezbollah announced that a member of the group from Kafr Kila had been killed \"while carrying out his jihadist duty.\"\nTonight, an IDF air-strike on the village of A-Sultania in southern Lebanon.\nAccording to the reports, one of the dead - a field commander in Hezbollah's Radwan Force named Abbas Jaafar.",
        "classification": "security",
        "score": 0.9891879946922808
    },
    {
        "id": "79549db8-41f5-4392-b3db-8d5f2da9535c",
        "title": "Israel says Hezbollah commander killed in Lebanon strike",
        "date": "2024-04-08T09:30:00+00:00",
        "url": "https://gulfnews.com/world/mena/israel-says-hezbollah-commander-killed-in-lebanon-strike-1.102064514",
        "message": "JERUSALEM: The Israeli military said on Monday it killed a Hezbollah commander in an overnight air strike in Lebanon, as cross-border violence flares between Israel and the Iran-backed armed group.\nAt least two other people were killed in the strike, according to the Israeli military, Lebanese state media and a security source.\nHussein was a “commander of the Hezbollah terrorist organisation’s Radwan Forces in the Hujeir region,” the Israeli statement said, adding that two other Hezbollah fighters were also killed.\nA Lebanese security source told AFP that “a local commander... from (Hezbollah’s) Radwan unit” was killed in the Israeli strike along with two other members of the group.\nThe cross-border hostilities have killed at least 363 people in Lebanon, mostly Hezbollah fighters but also including at least 70 civilians, according to an AFP tally.",
        "classification": "security",
        "score": 0.9775186695787885
    },
    {
        "id": "9d6a4a18-e206-4b63-82ba-5f336199e9f6",
        "title": "Zahedi , Iran general killed in Syria , was on Hezbollah top council",
        "date": "2024-04-09T08:15:00+00:00",
        "url": "https://www.naharnet.com:443/stories/en/304487-zahedi-iran-general-killed-in-syria-was-on-hezbollah-s-top-council",
        "message": "An Iranian general killed in a strike in Syria's capital was a member of Hezbollah's Shura Council, the powerful Lebanese group's decision-making body, a source close to the movement said.\nOne of them was Mohammad Reza Zahedi, a senior commander in the Quds Force, the Guards' foreign operations arm.\nZahedi was the only non-Lebanese on Hezbollah's eight-member Shura Council, the equivalent of the powerful Shiite Muslim movement's political bureau, led by secretary general Sayyed Hassan Nasrallah, the source said, requesting anonymity because the matter is sensitive.\nNasrallah in a speech Monday paid homage to Zahedi and his colleagues killed in the strike, which Tehran and Damascus have blamed on Israel.\nIn a previous speech, Nasrallah said his group \"owed a lot\" to the senior Iranian official.",
        "classification": "security",
        "score": 0.8651639709510593
    },
    {
        "id": "53396ac5-3a0a-4314-b797-8af70fb030dd",
        "title": "Israel says Hezbollah commander killed in Lebanon strike",
        "date": "2024-04-08T10:45:00+00:00",
        "url": "https://www.bssnews.net/international/182909",
        "message": "JERUSALEM, April 8, 2024 (BSS/AFP) - The Israeli military said Monday it killed a Hezbollah commander in an overnight air strike in Lebanon, as cross-border violence flares between Israel and the Iran-backed armed group.\nAt least two other people were killed in the strike, according to the Israeli military, Lebanese state media and a security source.\nHussein was a \"commander of the Hezbollah terrorist organisation's Radwan Forces in the Hujeir region,\" the Israeli statement said, adding that two other Hezbollah fighters were also killed.\nA Lebanese security source told AFP that \"a local commander... from (Hezbollah's) Radwan unit\" was killed in the Israeli strike along with two other members of the group.\nThe latest overnight strike on Lebanon came after the Israeli army said on Sunday it had completed \"another phase of... readiness for war\" on the Lebanon front.",
        "classification": "security",
        "score": 0.9757920931135246
    },
    {
        "id": "0d310569-4c4e-48ba-9781-8af88d887ef3",
        "title": "Israel : Hezbollah commander killed in Lebanon air strike",
        "date": "2024-04-08T15:00:00+00:00",
        "url": "https://manilastandard.net/news/314433709/israel-hezbollah-commander-killed-in-lebanon-air-strike.html",
        "message": "- Advertisement -JERUSALEM — The Israeli military said Monday it killed a Hezbollah commander in an overnight air strike in Lebanon, as cross-border violence flares between Israel and the Iran-backed armed group.\nAt least two other people were killed in the strike, according to the Israeli military, Lebanese state media and a security source.\nHussein was a “commander of the Hezbollah terrorist organisation’s Radwan Forces in the Hujeir region,” the Israeli statement said, adding that two other Hezbollah fighters were also killed.\nA Lebanese security source told AFP that “a local commander… from (Hezbollah’s) Radwan unit” was killed in the Israeli strike along with two other members of the group.\nThe latest overnight strike on Lebanon came after the Israeli army said on Sunday it had completed “another phase of… readiness for war” on the Lebanon front.",
        "classification": "security",
        "score": 0.9752738149516508
    },
    {
        "id": "fa3305e5-e0ae-4b61-be67-d5509c5d133f",
        "title": "Israel says Hezbollah commander killed in Sultaniyeh strike",
        "date": "2024-04-08T10:45:00+00:00",
        "url": "https://www.naharnet.com/stories/en/304460-israel-says-hezbollah-commander-killed-in-sultaniyeh-strike",
        "message": "The Israeli military said Monday it killed a Hezbollah commander in an overnight air strike in Lebanon, as cross-border violence flares between Israel and the Iran-backed armed group.\nAt least two other people were killed in the strike, according to the Israeli military, Lebanese state media and a security source.\nHussein was a \"commander of the Hezbollah terrorist organization's Radwan Forces in the Hujeir region,\" the Israeli statement said, adding that two other Hezbollah fighters were also killed.\nA Lebanese security source told AFP that \"a local commander... from (Hezbollah's) Radwan unit\" was killed in the Israeli strike along with two other members of the group.\nHezbollah and Israel last fought a war in 2006.",
        "classification": "security",
        "score": 0.9563251153269339
    },
    {
        "id": "2d104f12-209d-428f-a978-f2d7fce12683",
        "title": "Israel says Hezbollah commander killed in Sultaniyeh strike",
        "date": "2024-04-08T09:45:00+00:00",
        "url": "https://www.naharnet.com:443/stories/en/304460-israel-says-hezbollah-commander-killed-in-sultaniyeh-strike",
        "message": "The Israeli military said Monday it killed a Hezbollah commander in an overnight air strike in Lebanon, as cross-border violence flares between Israel and the Iran-backed armed group.\nAt least two other people were killed in the strike, according to the Israeli military, Lebanese state media and a security source.\nHussein was a \"commander of the Hezbollah terrorist organization's Radwan Forces in the Hujeir region,\" the Israeli statement said, adding that two other Hezbollah fighters were also killed.\nA Lebanese security source told AFP that \"a local commander... from (Hezbollah's) Radwan unit\" was killed in the Israeli strike along with two other members of the group.\nHezbollah and Israel last fought a war in 2006.",
        "classification": "security",
        "score": 0.9563251153269339
    },
    {
        "id": "ce693352-a8fb-40bb-ab27-fed31b98f4b4",
        "title": "Israel says Hezbollah commander killed in Sultaniyeh strike",
        "date": "2024-04-08T09:15:00+00:00",
        "url": "https://www.naharnet.com/stories/en/304460",
        "message": "The Israeli military said Monday it killed a Hezbollah commander in an overnight air strike in Lebanon, as cross-border violence flares between Israel and the Iran-backed armed group.\nAt least two other people were killed in the strike, according to the Israeli military, Lebanese state media and a security source.\nHussein was a \"commander of the Hezbollah terrorist organization's Radwan Forces in the Hujeir region,\" the Israeli statement said, adding that two other Hezbollah fighters were also killed.\nA Lebanese security source told AFP that \"a local commander... from (Hezbollah's) Radwan unit\" was killed in the Israeli strike along with two other members of the group.\nHezbollah and Israel last fought a war in 2006.",
        "classification": "security",
        "score": 0.9563251153269339
    },
    {
        "id": "56c527d0-4145-40ac-9595-9fba405a1b9c",
        "title": "Four killed in Russian air strikes on Ukraine north and south",
        "date": "2024-04-08T17:00:00+00:00",
        "url": "https://www.yahoo.com/news/four-killed-russian-air-strikes-160444210.html",
        "message": "(Reuters) -Russian attacks dispersed through different regions of Ukraine killed five people on Monday, officials said.\nA missile strike killed three people and injured at least eight in the southern city of Zaporizhzhia, regional governor Ivan Fedorov said.\nAn industrial building, seven apartment blocks, as well as medical and educational facilities were damaged, authorities said.\nThe governor of central Poltava region said a Russian attack killed one person, injured 10 and damaged several dwellings.\nLast Friday, another industrial site in the city was also targeted by a Russian missile strike, which damaged residential buildings and killed four people.",
        "classification": "security",
        "score": 0.9305727858757219
    },
    {
        "id": "7cfeb5c1-58b8-4b9d-a667-7047759b8413",
        "title": "UK to deploy Royal Navy to deliver food , supplies to Gaza",
        "date": "2024-04-07T19:00:00+00:00",
        "url": "https://economictimes.indiatimes.com/news/defence/uk-to-deploy-royal-navy-to-deliver-food-supplies-to-gaza/articleshow/109112588.cms",
        "message": "(You can now subscribe to our(You can now subscribe to our Economic Times WhatsApp channelThe UK will deploy a Royal Navy ship to increase its humanitarian support to Gaza , days after an Israeli military strike killed three British aid workers.The vessel, along with £9.7 million ($12 million) of pledged spending, will support the ongoing effort to set up a maritime corridor from Cyprus to Gaza, which is expected to be operational in early May.\nThe allocated funds will go toward aid deliveries, logistical expertise and equipment such as forklift trucks and storage units, according to a statement late Saturday.The increased aid comes days after an Israeli army missile strike killed seven World Central Kitchen aid workers in Gaza, including three British nationals.\nThe army dismissed two officers after the attacks, attributing the strike to \"mistaken identification, errors in decision making, and an attack contrary to standard operating procedures.\n\"Prime Minister Rishi Sunak is coming under mounting pressure to halt the sale of British arms to Israel.\nThree former supreme court justices said that the UK is breaching international law by providing weapons to Israel, while some Conservative politicians suggested they would also support suspending defense exports.Sunak, who has adopted a tougher tone toward the UK ally in recent months, renewed calls on Saturday for an end to the conflict and a release of the hostages.",
        "classification": "world",
        "score": 0.6033067268145557
    },
    {
        "id": "444b0a07-963a-480e-a547-08ff1d672a69",
        "title": "Father of humanitarian worker killed in Gaza urges Blinken to suspend aid to Israel",
        "date": "2024-04-07T20:15:00+00:00",
        "url": "https://nypost.com/2024/04/07/us-news/father-of-humanitarian-worker-killed-in-gaza-urges-blinken-to-suspend-aid-to-israel/",
        "message": "6 Jacob Flickinger was one of the seven humanitarian workers killed in an Israeli air strike in Gaza.\nWORLD CENTRAL KITCHEN/AFP via Getty Images6 The World Central Kitchen vehicle that was hit while delivering aid.\n6 Flickinger’s father John Flickinger urged Secretary of State Antony Blinken to adopt a tougher stance on Israel.\n6 Flickinger and the six other World Central Kitchen workers killed in the strike.\nAPWorld Central Kitchen representatives have said they informed the Israeli military of their movements and the presence of their convoy.",
        "classification": "security",
        "score": 0.9084658084756776
    },
    {
        "id": "966e3b2e-1986-4046-b382-991e4b212c0d",
        "title": "Four killed in Russian air strikes on Ukraine north and south",
        "date": "2024-04-08T16:30:00+00:00",
        "url": "https://www.marketscreener.com/quote/currency/US-DOLLAR-RUSSIAN-ROUBLE--2370597/news/Four-killed-in-Russian-air-strikes-on-Ukraine-s-north-and-south-46388649/",
        "message": "(Reuters) -Russian attacks dispersed through different regions of Ukraine killed five people on Monday, officials said.\nA missile strike killed three people and injured at least eight in the southern city of Zaporizhzhia, regional governor Ivan Fedorov said.\nAn industrial building, seven apartment blocks, as well as medical and educational facilities were damaged, authorities said.\nThe governor of central Poltava region said a Russian attack killed one person, injured 10 and damaged several dwellings.\nLast Friday, another industrial site in the city was also targeted by a Russian missile strike, which damaged residential buildings and killed four people.",
        "classification": "security",
        "score": 0.9305727858757219
    },
    {
        "id": "fd7b2cb5-e38d-4dde-aec8-2949bcb8a851",
        "title": "Three people killed , eight injured as result of missile strike in Zaporizhia",
        "date": "2024-04-08T17:15:00+00:00",
        "url": "https://en.interfax.com.ua/news/general/978946.html",
        "message": "Three people killed, eight injured as result of missile strike in ZaporizhiaAs a result of a Russian missile strike on an industrial facility in Zaporizhia, three people were killed, said head of Zaporizhia Regional Military Administration, Ivan Fedorov.\n\"Three lives were cut short by an enemy missile strike on an industrial facility in Zaporizhia.\nEight people received injuries of varying severity,\" Fedorov wrote on the Telegram channel.\nFourteen buildings were previously damaged, including seven high-rise buildings, a health facility and a cultural institution.",
        "classification": "security",
        "score": 0.8634694709121422
    },
    {
        "id": "aa9a480c-ffbd-491b-8d75-4bf0c4afa7e5",
        "title": "Iraq Weekly Roundup : Seven Killed",
        "date": "2024-04-09T06:00:00+00:00",
        "url": "https://original.antiwar.com/updates/2024/04/08/iraq-weekly-roundup-seven-killed-2/",
        "message": "At least seven people were killed, and two were wounded in recent violence:Six guerrillas were killed in Turkish strikes against Kurdistan Workers’ Party (P.K.K.)\ntargets in Metina and Gara.\nA separate Turkish strike killed a P.K.K.\ncommander and wounded two others in Sinjar.",
        "classification": "security",
        "score": 0.9982317054414849
    },
    {
        "id": "736d9bab-e972-4220-a813-4be106c30f89",
        "title": "Israeli warplanes hit Syrian military position after Golan attack",
        "date": "2024-04-09T10:30:00+00:00",
        "url": "https://www.dailysabah.com/world/mid-east/israeli-warplanes-hit-syrian-military-position-after-golan-attack",
        "message": "Israeli warplanes conducted overnight airstrikes on a Syrian military position in retaliation for rocket fire on the Israeli-annexed Golan Heights, the military confirmed on Tuesday.\nThe Israeli military stated that the airstrikes targeted the Syrian army military infrastructure in the Mahajjah area, approximately 30 kilometers (20 miles) from the demilitarized zone that separates the two opposing forces.\nThe Israeli army said it identified a rocket launch from Syrian territory on Monday that caused no casualties.\nIsrael has raised its military readiness after last week's deadly strike on the Iranian consulate in Damascus drew threats of retaliation from Tehran.\nIsrael captured the Golan Heights in the Six-Day War of 1967 and later annexed it, a move never recognized internationally.",
        "classification": "security",
        "score": 0.960779789733546
    },
    {
        "id": "ca477317-4447-43bc-9ee9-23e6d4c1c29a",
        "title": "Iran FM opens new Syria consulate after deadly strike",
        "date": "2024-04-08T15:30:00+00:00",
        "url": "https://www.yahoo.com/news/iran-fm-opens-syria-consulate-150400167.html",
        "message": "The strike came against the backdrop of Israel and Hamas's ongoing war, which began with the Iran-backed Palestinian militant group's unprecedented October 7 attack on Israel.\n\"America is responsible for this incident and must be held accountable,\" Iranian Foreign Minister Hossein Amir-Abdollahian told reporters in Damascus.\nIran's foreign minister began a regional tour Sunday in Oman, long a mediator between Tehran and the West, where Muscat's foreign minister called for de-escalation.\nAn adviser to Iran's supreme leader warned on Sunday that Israeli embassies were \"no longer safe\" after the Damascus attack.\nThe Syrian Observatory for Human Rights war monitor said 16 people were killed in the consulate strike: eight Iranians, five Syrians, one member of Lebanon's Hezbollah militant group and two civilians.",
        "classification": "security",
        "score": 0.7298818364961513
    },
    {
        "id": "07af663f-20ff-409c-a514-db87df610e70",
        "title": "Five killed in attacks in different Ukrainian regions",
        "date": "2024-04-08T22:45:00+00:00",
        "url": "https://www.swissinfo.ch/eng/five-killed-in-attacks-in-different-ukrainian-regions/75334007",
        "message": "Five killed in attacks in different Ukrainian regions2 minutes(Reuters) -Russian attacks dispersed through different regions of Ukraine killed five people on Monday, officials said.\nA missile strike killed three people and injured at least eight in the southern city of Zaporizhzhia, regional governor Ivan Fedorov said.\nAn industrial building, seven apartment blocks, as well as medical and educational facilities were damaged, authorities said.\nThe governor of central Poltava region said a Russian attack killed one person, injured 10 and damaged several dwellings.\nLast Friday, another industrial site in the city was also targeted by a Russian missile strike, which damaged residential buildings and killed four people.",
        "classification": "security",
        "score": 0.9463397903223243
    },
    {
        "id": "cdf621de-db75-4b4a-876e-9013db10d4b9",
        "title": "Russian missile hits industrial facility in Ukraine Zaporizhzhia , governor says",
        "date": "2024-04-08T16:30:00+00:00",
        "url": "https://bdnews24.com/world/engr7vjchz",
        "message": "Last Friday, an unidentified industrial facility in the city was struck by a Russian missile strike which also damaged residential buildings and killed four people.\nIt was not clear if Monday's strike targeted the same site.\nSeparately, Russian officials accused Ukraine of launching drone strikes against the Zaporizhzhia nuclear power plant, located southwest of the city and occupied by Moscow troops.\nMoscow-installed officials have made a series of claims since last week.\nKyiv said it has nothing to do with incidents at the power station reported by Russia and called them \"armed provocations\".",
        "classification": "security",
        "score": 0.7639170234291291
    },
    {
        "id": "2b911879-3f8c-4707-af0c-7126b6576ca9",
        "title": "Israel prepared to handle any developments with Iran , defence chief says",
        "date": "2024-04-07T20:45:00+00:00",
        "url": "https://www.channelnewsasia.com/world/israel-prepared-handle-any-developments-iran-defence-chief-says-4248841",
        "message": "JERUSALEM: Israel is ready to handle any scenario that may arise with Iran, Defence Minister Yoav Gallant said on Sunday (Apr 7), after Tehran threatened to retaliate for the killing of Iranian generals on Apr 1.\nGallant's office issued the statement about Israel's preparedness after he held an \"operational situation assessment\" with senior military officers.\n\"Upon completing the assessment, Minister Gallant emphasized that the defence establishment has completed preparations for responses in the event of any scenario that may develop vis-à-vis Iran,\" his office said.\nThe Chief of General Staff, Herzi Halevi, said Israel \"knows how to deal with Iran - offensively and defensively\".\nWe are operating in cooperation with the USA and strategic partners in the region,\" he said in televised remarks.",
        "classification": "world",
        "score": 0.6317964277507978
    },
    {
        "id": "f1e2d23c-aca1-4d9f-9c07-243289444599",
        "title": "Crude oil prices today : WTI , Brent fall as market braces for Iran retaliation",
        "date": "2024-04-08T13:30:00+00:00",
        "url": "https://www.cnbc.com/2024/04/08/crude-oil-prices-today.html",
        "message": "Iranians attend the funeral procession for seven Islamic Revolutionary Guard Corps members killed in a strike in Syria, which Iran blamed on Israel, in Tehran on April 5, 2024.\nU.S. crude oil futures fell Monday after Israel reduced its troop presence in Gaza.\nThe West Texas Intermediate contract for May delivery fell 48 cents, or 0.55%, to settle at $86.43 a barrel.\nIsrael withdrew forces from the southern Gaza city of Khan Younis over the weekend, bringing its troop levels in the enclave to one of the lowest levels since the war with Hamas began last October.\nNegotiations on a ceasefire between Israel and Hamas are ongoing in Cairo.",
        "classification": "security",
        "score": 0.9736153405495181
    },
    {
        "id": "915d0ab6-e9be-42f1-9cf5-6318905101ec",
        "title": "WSJ : BIDEN OPPORTUNISM : Blames Israel Instead Of Hamas , Forgets His Errors In Afghanistan – The Yeshiva World",
        "date": "2024-04-08T22:15:00+00:00",
        "url": "https://www.theyeshivaworld.com/news/israel-news/2275477/wsj-biden-opportunism-blames-israel-instead-of-hamas-forgets-his-errors-in-afghanistan.html",
        "message": "President Biden, seem to have forgotten that errors are a tragic and inevitable part of war.\nEgged on by the emerging anti-Israel liberal media consensus, Mr. Biden called on Thursday for an “immediate cease-fire” and urged Israel to make new concessions in hostage negotiations.\nMr. Biden also seems to have forgotten his own mistaken missile strike.\nRather than hold Hamas accountable and demand at every opportunity that it release the hostages, including five Americans, Mr. Biden places the full burden on Israel.\nMr. Biden has mostly resisted pressure from his left to cut off Israel and deny it the weapons it needs to defeat Hamas.",
        "classification": "world",
        "score": 0.7708462956604324
    },
    {
        "id": "e77187ae-289c-4352-a1b5-325abecdcdf4",
        "title": "Australia to appoint special adviser to probe aid worker killing - Newspaper",
        "date": "2024-04-08T03:15:00+00:00",
        "url": "https://www.dawn.com/news/1826344/australia-to-appoint-special-adviser-to-probe-aid-workers-killing",
        "message": "SYDNEY: Australia has said it will appoint a special adviser to work with Israel as it demands transparency in an investigation into an air strike on Gaza that killed seven aid workers, including an Australian.\nPrime Minister Anthony Albanese wants detailed answers as to how aid workers from the US-based World Central Kitchen were killed by Israeli forces last Monday.\nThe Australian government wants any probe by Israel to be monitored by its own adviser, who Albanese expects will be named “within the next twenty-four hours”.\nHis foreign minister Penny Wong has said information about the strike provided so far by Israel was insufficient and that the special adviser would monitor “the appropriateness of the (investigation) process”.\nIsrael’s military said it fired two officers over the killing of the aid workers in Gaza, where humanitarian groups say famine is imminent.",
        "classification": "security",
        "score": 0.7259901690821354
    },
    {
        "id": "b2946a4d-c947-4e72-b961-e0f1158e0740",
        "title": "Iran FM opens new Syria consulate after deadly strike",
        "date": "2024-04-08T16:30:00+00:00",
        "url": "https://www.voanews.com/a/iran-fm-opens-new-syria-consulate-after-deadly-strike-/7561315.html",
        "message": "Iran's foreign minister inaugurated the country's new consulate in Damascus on Monday, a week after a deadly strike blamed on Israel destroyed the former premises, sending regional tensions skyrocketing.\nThe strike came against the backdrop of the ongoing war between Israel and Hamas, which began with the Iran-backed Palestinian militant group's unprecedented October 7 attack on Israel.\nIran's foreign minister began a regional tour Sunday in Oman, long a mediator between Tehran and the West, where Muscat's foreign minister called for de-escalation.\nThe Syrian Observatory for Human Rights war monitor said 16 people were killed in the consulate strike: eight Iranians, five Syrians, one member of Lebanon's Hezbollah militant group and two civilians.\nIt rarely comments on individual strikes, but Israel's raids have increased since the Gaza war began.",
        "classification": "security",
        "score": 0.8322182187473884
    },
    {
        "id": "94627ce8-f3d9-47b1-8128-eeaea315b5e8",
        "title": "Former Defence chief Mark Binksin appointed to scrutinise investigation into Israeli air strike",
        "date": "2024-04-08T02:00:00+00:00",
        "url": "https://article.wn.com/view/2024/04/07/Former_Defence_chief_Mark_Binksin_appointed_to_scrutinise_in/",
        "message": "The government appoints former Defence chief Mark Binskin as special adviser to the investigation into an Israeli air strike that killed several aid workers, including Australian woman Zomi Frankcom.\n...... read full story",
        "classification": "security",
        "score": 0.8428251660734377
    },
    {
        "id": "1ce2fea4-2b46-4536-a6f4-667abc4d9147",
        "title": "Middle East crisis : Biden ally opposes halting weapons transfers to Israel ; IDF withdraws southern Gaza troops",
        "date": "2024-04-07T23:00:00+00:00",
        "url": "https://www.dailymaverick.co.za/article/2024-04-08-biden-ally-opposes-halting-weapons-transfers-to-israel-idf-withdraws-southern-gaza-troops/",
        "message": "Damage to homes in Hamad Town after Israeli airstrikes on 17 March 2024 in Khan Yunis, Gaza.\nThe UK’s support for Israel was “not unconditional”, Foreign Secretary David Cameron warned days after an Israeli military strike killed three British aid workers.\nBiden has come under renewed pressure to restrict US support for Israel after the aid workers, including a US-Canadian dual national, were killed last week.\nNetanyahu also said there would be “no ceasefire without the return of hostages” held in Gaza by Hamas since October.\n“There will still be thousands of IDF soldiers in the south of Gaza,” Coons said on Fox News on Sunday.",
        "classification": "world",
        "score": 0.46717372067325674
    },
    {
        "id": "4184359f-9e73-4f75-9e91-45fba80247bd",
        "title": "Hamas emergency committee leader killed in central Gaza airstrike hours after ceasefire rejected - World News",
        "date": "2024-04-09T10:30:00+00:00",
        "url": "https://www.mirror.co.uk/news/world-news/hamas-emergency-committee-leader-killed-32544181",
        "message": "Alramery was in charge of the Hamas Emergency Bureau in Central Camps, a hidden cell in Gaza’s central refugee camps, according to the IDF.\nThe top Hamas commander was responsible for multiple rocket launches from the Al-Maghazi Battalion of the Central Camps.\nThe assignation came just hours after the terror group rejected Israel's ceasefire proposal as it scorned Benjamin Netanyahu ’s government as “stubborn”.\nAlso during Monday’s offensive, the IAF eliminated another terrorist in Khan Yunis, southern Gaza, who participated in the bloody October 7 massacre in Negev.\nAs Israel withdrew most of its troops from southern Gaza, it looked as though the stalemate could be ended.",
        "classification": "security",
        "score": 0.9817714832172335
    },
    {
        "id": "03c509d1-b376-426f-ad07-7ff0112deacf",
        "title": "Senior Hezbollah Commander Killed in IDF Airstrike",
        "date": "2024-04-08T21:00:00+00:00",
        "url": "https://unitedwithisrael.org/senior-hezbollah-commander-killed-in-idf-airstrike/",
        "message": "Hassin is the second high-ranking Hezbollah official killed in an Israeli strike in the Hijar region in recent months.\nThe attack was carried out near the village of As-Sultaniya, according to the IDF, which named the commander as Ali Ahmed Hassin, Radwan commander of the Hajir region.\nAccording to the IDF, he “was a senior operative in the terrorist organization and held a rank equivalent to that of brigade commander.\nHassin is the second high-ranking Hezbollah official killed in an Israeli strike in the Hijar region in recent months.\nAdditional Hezbollah terror sites were targeted on Saturday night in Ayta ash Shab and Odaisseh in Southern Lebanon, the IDF announced.",
        "classification": "security",
        "score": 0.9484933925913229
    },
    {
        "id": "c9fbbbf3-d4f3-4377-a1aa-ba8c595348bd",
        "title": "Iran foreign minister accuses U . S . of giving Israel  green light  to attack consulate in Syria",
        "date": "2024-04-08T17:45:00+00:00",
        "url": "https://www.newsday.com/news/nation/syria-iran-israel-hezbollah-lebanon-consulate-amirabdollahian-f05737",
        "message": "DAMASCUS, Syria — Iran's foreign minister Monday accused the United States of giving Israel the “green light” for a strike on its consulate building in Syria that killed seven Iranian military officials including two generals.\nSyrian Foreign Minister Faisal Mekdad, right, speaks with Iranian Foreign Minister Hossein Amirabdollahian during a joint press conference in Damascus, Syria, Monday, April 8, 2024.\nIran's foreign minister Monday accused the United States of giving Israel the \"green light\" to strike its consulate building in Syria that killed seven Iranian military officials including two generals.\nIranian Foreign Minister Hossein Amirabdollahian, right, leaves after the opening of the new Iranian consulate building in Damascus, Syria, Monday, April 8, 2024.\nIran's foreign minister Monday accused the United States of giving Israel the \"green light\" to strike the consulate building in Syria that killed seven Iranian military officials including two generals.",
        "classification": "security",
        "score": 0.7722278982646931
    },
    {
        "id": "3065b399-335f-489b-a935-f0dd00d73995",
        "title": "Biden bashes Israel over killing of 7 aid workers : Letters",
        "date": "2024-04-07T20:15:00+00:00",
        "url": "https://nypost.com/2024/04/07/opinion/biden-bashes-israel-over-killing-of-7-aid-workers-letters/",
        "message": "The Issue: President Biden’s criticism of Israel after an airstrike killed seven aid workers in Gaza.\nPresident Biden is outraged at Israeli Prime Minister Benjamin Netanyahu over the unfortunate death of seven World Central Kitchen aid workers (“Joe: we’d rethink support,” Apr.\nBiden blames Israel rather than the real culprits, Hamas, who broke the ceasefire by invading Israel and killing more than 1,200 civilians — including the elderly, women and children.\nWorld Central Kitchen must accept that there will occasionally be casualties in their line of work.\nThe nerve of Biden to claim he is outraged, enraged and heartbroken over the seven aid workers mistakenly killed in Gaza.",
        "classification": "world",
        "score": 0.6824903935691273
    },
    {
        "id": "b83b5c65-da8b-411f-b6d9-8be308933ac1",
        "title": "Israeli strike kills Hezbollah commander",
        "date": "2024-04-08T21:15:00+00:00",
        "url": "https://www.thedailystar.net/news/world/news/israeli-strike-kills-hezbollah-commander-3585406",
        "message": "UN urges halt to fightingAn Israeli strike on southern Lebanon early yesterday killed a field commander in the heavily-armed Lebanese group Hezbollah, as the United Nations warned that shelling was spreading and urged a halt to the violence.\nHezbollah and the Israeli military have been exchanging fire across Lebanon's southern frontier in parallel with the Gaza offensive.\nEarly yesterday, Israeli fighter jets hit the village of al-Sultaniyah and killed a field commander in Hezbollah's elite Radwan units and two others, Israeli military and Lebanese security sources said.\nThe Israeli military identified the commander as Ali Ahmed Hassin, and said he was responsible for executing attacks against Israelis.",
        "classification": "security",
        "score": 0.9893934392507088
    },
    {
        "id": "ac014cb7-207b-4523-95ea-489e13ef01f3",
        "title": "Iran FM accuses US of approving strike on Damascus consulate",
        "date": "2024-04-08T17:45:00+00:00",
        "url": "https://www.al-monitor.com/originals/2024/04/iran-fm-accuses-us-approving-strike-damascus-consulate",
        "message": "April 8, 2024 — Damascus (AFP)Iran's foreign minister again accused the United States Monday of approving a deadly strike blamed on Israel that destroyed Tehran's Damascus consulate last week, after he inaugurated a new consulate in the Syrian capital.\nThe strike came against the backdrop of Israel and Hamas's ongoing war, which began with the Iran-backed Palestinian militant group's unprecedented October 7 attack on Israel.\n\"America is responsible for this incident and must be held accountable,\" Iranian Foreign Minister Hossein Amir-Abdollahian told reporters in Damascus.\nIran's foreign minister began a regional tour Sunday in Oman, long a mediator between Tehran and the West, where Muscat's foreign minister called for de-escalation.\nAn adviser to Iran's supreme leader warned on Sunday that Israeli embassies were \"no longer safe\" after the Damascus attack.",
        "classification": "security",
        "score": 0.5067599525459947
    },
    {
        "id": "69d3d9ba-db7e-4fbe-96ea-113fea59d051",
        "title": "Iran Pays Homage To Guards Killed In Syria Strike , Vows Revenge",
        "date": "2024-04-08T05:00:00+00:00",
        "url": "https://menafn.com/1108069183/Iran-Pays-Homage-To-Guards-Killed-In-Syria-Strike-Vows-Revenge",
        "message": "Guards chief General Hossein Salami warned that Israel \"cannot escape the consequences\" of Monday's strike, which levelled the five-storey consular annex of the Iranian embassy in Damascus.\nFriday's ceremony coincided with annual Quds (Jerusalem) Day commemorations, when Iran and its allies organise marches in support of the Palestinians.\nQuds Day rallies also took place in Syria, Iraq, Yemen and Bahrain while in Lebanon the head of the Iran-backed Hizbollah movement delivered a speech.\nIran has said among the dead were two brigadier generals from the Guards' foreign operations arm, the Quds Force, Mohammad Hadi Haji Rahimi and Mohammad Reza Zahedi.\nIsrael has long fought a shadow war of assassinations and sabotage against Iran and its allies, including Hizbollah, carrying out hundreds of strikes against targets in Syria.",
        "classification": "security",
        "score": 0.9345054483466756
    },
    {
        "id": "e40f1dc7-156d-4322-b6ff-11be09c835b7",
        "title": "Iran foreign minister visits Oman on regional tour",
        "date": "2024-04-07T20:00:00+00:00",
        "url": "https://www.voanews.com/a/7560360.html",
        "message": "Oman's foreign minister called Sunday for de-escalation during a visit by his Iranian counterpart who started a regional tour in Muscat where he met a spokesperson for Yemen's Houthi rebels.\nThe visit by Iranian Foreign Minister Hossein Amirabdollahian came almost a week after an airstrike in Damascus leveled the Iranian Embassy's consular annex and further raised regional tensions.\nAmirabdollahian praised growing ties between Iran and Oman, thanking the sultanate for its condemnation of the Damascus strike.\nThe Gulf country is also a mediator in the war between Yemen's Iran-backed Houthi rebels and Yemen's internationally recognized government.\nHouthi rebels have launched dozens of missiles and drone strikes on shipping in the Red Sea and the Gulf of Aden since November.",
        "classification": "security",
        "score": 0.4755319982493271
    },
    {
        "id": "2500625f-dc8d-4445-ba18-fbf8a582a019",
        "title": "🔴 Live : Israel deploys C - Dome defence system for the first time",
        "date": "2024-04-09T02:15:00+00:00",
        "url": "https://www.france24.com/en/middle-east/20240409-%F0%9F%94%B4-live-israel-deploys-c-dome-defence-system-for-the-first-time",
        "message": "About casualty figures from Gaza’s Hamas-run health ministry:Gaza’s health ministry collects data from the enclave’s hospitals and the Palestinian Red Crescent.\nThroughout four wars and numerous skirmishes between Israel and Hamas, UN agencies have cited the Hamas-run health ministry’s death tolls in regular reports.\nThe International Committee of the Red Cross and Palestinian Red Crescent also use the numbers.\nThe UN's counts have largely been consistent with the Gaza health ministry’s, with small discrepancies.\nFor more on the Gaza health ministry’s tolls, click here.",
        "classification": "security",
        "score": 0.7358570695212174
    },
    {
        "id": "bff945da-7935-457a-802e-f796413a4711",
        "title": "Iran foreign minister accuses U . S . of giving Israel  green light  to attack consulate",
        "date": "2024-04-09T03:45:00+00:00",
        "url": "https://article.wn.com/view/2024/04/09/Iran_s_foreign_minister_accuses_US_of_giving_Israel_green_li_2/",
        "message": "DAMASCUS — Iran’s foreign minister Monday accused the United States of giving Israel the “green light” for a strike on its consulate building in Syria that killed seven Iranian military officials including two generals.Advertisement 2 Story continues below This advertisement has not loaded yet, but your... read full story\"I'd like to say with a very loud voice from here in Damascus that America has a responsibility in what happened and must be held responsible,\"",
        "classification": "security",
        "score": 0.812934642324897
    },
    {
        "id": "e723df3a-08ed-4204-8ea2-180cc61261c4",
        "title": "Israel - Hamas War | New York Post",
        "date": "2024-04-07T20:15:00+00:00",
        "url": "https://nypost.com/tag/israel-hamas-war/",
        "message": "Cosgrave made no mention of the controversial circumstances surrounding his exit in his comeback post on X, instead writing that “it was the first time I had taken time off...",
        "classification": "security",
        "score": 0.3310993433622007
    },
    {
        "id": "ea053caf-e716-4922-8ac9-167be56207d3",
        "title": "Ukraine To Lose War If US Congress Withholds Aid Zelensky",
        "date": "2024-04-07T17:45:00+00:00",
        "url": "https://www.channelstv.com/2024/04/07/ukraine-to-lose-war-if-us-congress-withholds-aid-zelensky/",
        "message": "Ukrainian President Volodymyr Zelensky said Sunday that Kyiv will lose the war against Russia if the US Congress does not approve military aid to battle Moscow’s invasion.\n“It is necessary to specifically tell Congress that if Congress does not help Ukraine, Ukraine will lose the war,” Zelensky said during a video meeting of Kyiv-organised fundraising platform United24.\nZelensky said it would be “difficult” for Ukraine to “stay” (survive) without the aid.\nHe said that “if Ukraine loses the war, other states will be attacked.”Russia’s invasion of Ukraine has dragged on for more than two years.\nKyiv said Sunday that a Russian strike on the town of Gulyaipole in the southern Zaporizhzhia region killed three people.",
        "classification": "world",
        "score": 0.49958860255937804
    },
    {
        "id": "d8e7ccd3-1347-4bd3-aeee-36cebe0cb3ca",
        "title": "US on high alert for Iran threat in region after Israeli strike in Syria",
        "date": "2024-04-07T20:30:00+00:00",
        "url": "https://www.pakistantoday.com.pk/2024/04/07/us-on-high-alert-for-iran-threat-in-region-after-israeli-strike-in-syria/",
        "message": "WASHINGTON: The United States is on high alert and preparing for a possible attack by Iran targeting Israeli or American assets in the region in response to Israel’s strike on the Iranian embassy in Syria, a US official said on Friday.\n“We’re definitely at a high state of vigilance,” the official said in confirming a CNN report that said an attack could come in the next week.\nSuspected Israeli warplanes bombed Iran’s embassy in Damascus on Monday in a strike that killed an Iranian military commander and marked a major escalation in Israel’s war with its regional adversaries.\nIran said it reserves the right “to take a decisive response.”US President Joe Biden discussed the threat from Iran in a phone call on Thursday with Israeli Prime Minister Benjamin Netanyahu.\nThe United States fully supports the defence of Israel against threats from Iran,” a senior Biden administration official said.",
        "classification": "world",
        "score": 0.9298960622570602
    },
    {
        "id": "8563488f-e5b4-474f-b366-0051804a4638",
        "title": "Israel kills Hezbollah field commander in Lebanon strike",
        "date": "2024-04-08T12:00:00+00:00",
        "url": "https://www.aljazeera.com/news/2024/4/8/israel-kills-hezbollah-field-commander-in-lebanon-2",
        "message": "The Israeli military says it has killed a Hezbollah commander in an overnight air strike in Lebanon, as the United Nations warns that shelling was spreading and urges a halt to the cycle of violence.\nAt least three other Hezbollah fighters were also killed in the strike, Al Jazeera has learned.\nHezbollah fighters said they were targeting an army base and air defence posts in the area.\nIsraeli strikes have killed about 270 Hezbollah fighters in the last six months, as well as around 50 civilians, including children, medics and journalists.\nAl Jazeera’s Ali Hashem, reporting from Kafra in southern Lebanon, said the cross-border fighting and strikes illustrate the “changing dynamics in the past months” since the October 7 Hamas attack on Israel.",
        "classification": "security",
        "score": 0.9837373956547676
    },
    {
        "id": "b31e0d72-8a2f-48f2-97b4-a774e2e90c57",
        "title": "IDF Kills Hezbollah Radwan Commander ,  No Progress  In Hamas - Israel Talks , Iran FM Visits Syria",
        "date": "2024-04-08T13:45:00+00:00",
        "url": "https://article.wn.com/view/2024/04/08/IDF_Kills_Hezbollahs_Radwan_Commander_No_Progress_In_HamasIs/",
        "message": "The IDF says it eliminated a senior field commander in Hezbollah’s elite Radwan force in an airstrike in southern Lebanon overnight.\nThe air strike killed Ali Ahmed Hassin, who according to the IDF, held a rank equivalent to a brigade commander.\nHassin, IDF said, was charged with attacks on... read full story\"while carrying out his jihadist duty.\"",
        "classification": "security",
        "score": 0.9572335235169346
    },
    {
        "id": "c50e7d93-a67a-49f2-9918-60914a54079e",
        "title": "Iran foreign minister accuses US of giving Israel  green light  to attack consulate in Syria",
        "date": "2024-04-09T02:30:00+00:00",
        "url": "https://www.nzherald.co.nz/world/irans-foreign-minister-accuses-us-of-giving-israel-green-light-to-attack-consulate-in-syria/FETV46NKXJBFXG333N5NWY5K24/",
        "message": "Syrian President Bashar Assad, right, welcomes Iranian Foreign Minister Hossein Amirabdollahian before their meeting in Damascus, Syria, on Monday, April 8.\nIran's foreign minister on Monday accused the United States of giving Israel the \"green light\" to strike its consulate building in Syria killing seven Iranian military officials including two generals.\nPhoto / APSyrian President Bashar Assad, right, welcomes Iranian Foreign Minister Hossein Amirabdollahian before their meeting in Damascus, Syria, on Monday, April 8.\nIran's foreign minister on Monday accused the United States of giving Israel the \"green light\" to strike its consulate building in Syria killing seven Iranian military officials including two generals.\nPhoto / APIran’s foreign minister accused the United States of giving Israel the “green light” for a strike on its consulate building in Syria that killed seven Iranian military officials including two generals.",
        "classification": "security",
        "score": 0.7434191076643483
    },
    {
        "id": "2f59ad8e-78ca-470c-bd8b-875504c687af",
        "title": "US on high alert for Iran threat inregion after Israeli strike in Syria",
        "date": "2024-04-07T21:00:00+00:00",
        "url": "https://www.postcourier.com.pg/us-on-high-alert-for-iran-threat-inregion-after-israeli-strike-in-syria/",
        "message": "WASHINGTON: The United States is on high alert and preparing for a possible attack by Iran targeting Israeli or American assets in the region in response to Israel’s strike on the Iranian embassy in Syria, a U.S. official said on Friday.\n“We’re definitely at a high state of vigilance,” the official said in confirming a CNN report that said an attack could come in the next week.\nSuspected Israeli warplanes bombed Iran’s embassy in Damascus on Monday in a strike that killed an Iranian military commander and marked a major escalation in Israel’s war with its regional adversaries.\nIran has said it reserves the right “to take a decisive response.”US President Joe Biden discussed the threat from Iran in a phone call on Thursday with Israeli Prime Minister Benjamin Netanyahu.\nThe United States fully supports the defense of Israel against threats from Iran,” a senior Biden administration official said.",
        "classification": "world",
        "score": 0.924660518903273
    },
    {
        "id": "c61f443b-7c98-41e9-acb2-3a28a1ce432a",
        "title": "Iran FM opens new Syria consulate after deadly strike - World",
        "date": "2024-04-09T00:30:00+00:00",
        "url": "https://www.brecorder.com/news/40297832",
        "message": "DAMASCUS: Iran’s foreign minister inaugurated the country’s new consulate in Damascus on Monday, a week after a deadly strike blamed on Israel destroyed the former premises, sending regional tensions skyrocketing.\nThe strike came against the backdrop of Israel and Hamas’s ongoing war, which began with the Iran-backed Palestinian militant group’s unprecedented October 7 attack on Israel.\nDamascus and Tehran blame Israel for last Monday’s raid, but it has not commented.\nIran’s foreign minister began a regional tour Sunday in Oman, long a mediator between Tehran and the West, where Muscat’s foreign minister called for de-escalation.\nAn adviser to Iran’s supreme leader warned on Sunday that Israeli embassies were “no longer safe” after the Damascus attack.",
        "classification": "world",
        "score": 0.5072286873982993
    },
    {
        "id": "cb33405b-775d-4f1d-a6b3-c40466d65b69",
        "title": "Iran warns Israel its embassies are not safe after deadly Damascus strike",
        "date": "2024-04-07T17:30:00+00:00",
        "url": "https://www.bournemouthecho.co.uk/news/national/24236923.iran-warns-israel-embassies-not-safe-deadly-damascus-strike/",
        "message": "Regional tensions have threatened to draw the Middle East into a wider conflict as Israel’s war against Hamas marks six months.\nIsrael has been preparing for an Iranian response to the strike without directly acknowledging its involvement.\nIsraeli Prime Minister Benjamin Netanyahu said Israel is prepared for any response.\nThe forces withdrew to recuperate and prepare for future operations, while a significant number remain elsewhere in Gaza, said Israeli military officials.\nIsrael’s military continued to suffer losses, including in Khan Younis, where the military said four soldiers were killed in a battle with militants.",
        "classification": "security",
        "score": 0.9470292409731694
    },
    {
        "id": "f8226bf8-6289-4f6a-89d4-d8c27dd22998",
        "title": "Israel - Gaza latest : Conflicting reports on possible ceasefire deal - as Israel pulls out almost all troops from southern Gaza",
        "date": "2024-04-08T10:45:00+00:00",
        "url": "https://news.sky.com/story/israel-gaza-latest-conflicting-reports-on-possible-ceasefire-deal-as-israel-pulls-out-almost-all-troops-from-southern-gaza-12978800",
        "message": "UK participates in largest international aid airdrop into GazaThe UK has participated in the largest airdrop of aid into Gaza on a single day today.\nLed by the Jordanian Armed Forces, a total of nine nations and 14 aircraft participated in the operation, delivering essential food, water and other supplies to civilians.\nThe Royal Air Force participated in the airdrop into Gaza and it coincided with Eid al-Fitr, which marks the end of Ramadan.\nCollectively delivering hundreds of tonnes of aid, this was the largest airdrop of aid into Gaza on a single day, the Ministry of Defence said.\nIt is also the sixth RAF airdrop in recent weeks, delivering over 53 tonnes of aid.",
        "classification": "science",
        "score": 0.3988763818319542
    },
    {
        "id": "f152c816-545b-47bc-8daa-f2a92f05652d",
        "title": "Israeli airstrikes target Hezbollah positions in southern Lebanon",
        "date": "2024-04-08T15:00:00+00:00",
        "url": "https://www.albawaba.com/news/israeli-airstrikes-target-hezbollah-positions-southern-lebanon-1560813",
        "message": "ALBAWABA- In a series of air raids, Israeli warplanes targeted multiple locations in southern Lebanon, including the outskirts of Halta and Kafar Shuba towns, as well as Mount Hermon and Al-Salamiyah.\nIsraeli Channel 12 reported intercepting an air target moving from southern Lebanon towards the Galilee settlement.\nThe Israeli military confirmed the assassination of a high-ranking Hezbollah commander, Ali Ahmed Hussein, in an overnight airstrike.\nAdditionally, the Israeli Army stated that a Hezbollah drone fell in an open area in Ras Naqoura, without causing any casualties.\nFurthermore, Israeli warplanes bombed a Hezbollah military building in the southern town of Kafr Kila, resulting in the death of a major Hezbollah commander.",
        "classification": "security",
        "score": 0.9963048782428551
    },
    {
        "id": "dea78807-8242-4d2c-8f10-03c89ae930c1",
        "title": "Iran foreign minister accuses U . S . of giving Israel  green light  to attack consulate in Syria – Winnipeg Free Press",
        "date": "2024-04-08T17:30:00+00:00",
        "url": "https://www.winnipegfreepress.com/world/2024/04/08/irans-foreign-minister-accuses-u-s-of-giving-israel-green-light-to-attack-consulate-in-syria",
        "message": "DAMASCUS, Syria (AP) — Iran’s foreign minister Monday accused the United States of giving Israel the “green light” for a strike on its consulate building in Syria that killed seven Iranian military officials including two generals.\nSyrian Foreign Minister Faisal Mekdad, right, speaks with Iranian Foreign Minister Hossein Amirabdollahian during a joint press conference in Damascus, Syria, Monday, April 8, 2024.\nIran's foreign minister Monday accused the United States of giving Israel the \"green light\" to strike its consulate building in Syria that killed seven Iranian military officials including two generals.\nAn Israeli airstrike that demolished Iran's consulate in Syria on last Monday killed two Iranian generals and five officers, according to Iranian officials.\nIran's foreign minister Monday accused the United States of giving Israel the \"green light\" to strike the consulate building in Syria that killed seven Iranian military officials including two generals.",
        "classification": "security",
        "score": 0.8066314119855001
    },
    {
        "id": "5a2cb6f5-9f42-4393-a727-bc55faaa1c8b",
        "title": "Cameron says support for Israel  not unconditional  as Sunak calls for cease - fire",
        "date": "2024-04-07T18:45:00+00:00",
        "url": "https://www.yahoo.com/news/cameron-says-support-israel-not-174111950.html",
        "message": "British Foreign Secretary David Cameron on Sunday warned his country's support for Israel is 'not unconditional' after aid workers will killed in an Israeli airstrike last week.\nFile Photo by Andy Rain/EPA-EFEApril 7 (UPI) -- British Prime Minister Rishi Sunak called for a humanitarian cease-fire in Gaza on Sunday as Foreign Minister David Cameron said British support for Israel is \"not unconditional.\"\nThis must never happen again,\" Cameron wrote, while emphasizing that the conflict started when Hamas attacked Israel on Oct. 7.\n\"We continue to stand by Israel's right to defeat the threat from Hamas terrorists and defend their security,\" Sunak said in his statement.\nSunak said the \"hostages must be released\" as he stressed that Israel needs to allow more aid to be delivered to people in Gaza.",
        "classification": "security",
        "score": 0.46176539896244656
    },
    {
        "id": "0e5e7c45-5812-4096-99b8-d89b3426392c",
        "title": "Authorities : Russian attacks in Donetsk Oblast kill 1 , injure 5 , including teenage girl",
        "date": "2024-04-08T18:45:00+00:00",
        "url": "https://www.yahoo.com/news/authorities-russian-attacks-donetsk-oblast-173156718.html",
        "message": "Russian attacks against Chasiv Yar and Selydove in Donetsk Oblast killed one person and wounded five more, including a teenage girl, regional authorities reported on April 8.\nSettlements in Ukraine’s eastern Donetsk Oblast suffer from daily Russian attacks due to their proximity to the front line.\nHeavy fighting continues in Donetsk Oblast as Russia seeks to occupy the entire region.\nAn apartment building in the town of Selydove was also hit, where five residents, including a 16-year-old girl, suffered injuries, according to the regional prosecutor’s office.\nRussian attacks against Donetsk Oblast on April 7 killed one person in Chasiv Yar and injured one in Yelyzavetivka, Filashkin reported earlier.",
        "classification": "security",
        "score": 0.9669270739148536
    },
    {
        "id": "7de0f559-a3e0-449d-a6e8-0bf579ac70f0",
        "title": "Governor : Russian attack on Poltava Oblast kills 1 , injures 10 , including 3 children",
        "date": "2024-04-08T21:00:00+00:00",
        "url": "https://www.yahoo.com/news/governor-russian-attack-poltava-oblast-203012755.html",
        "message": "Russian forces struck a residential building in Poltava Oblast late on April 8, killing one person and wounding 10 more, including three children, Governor Filip Pronin reported.\nPoltava is located in central Ukraine, hundreds of kilometers from the front lines.\nAt 9:30 p.m. local time, Pronin said that Russia targeted civilian infrastructure in the Poltava community.\nIn about an hour, the oblast governor clarified that a residential building was hit.\nA Russian April 8 missile strike on an industrial facility in the city of Zaporizhzhia killed three people and wounded eight more, the regional governor reported.",
        "classification": "security",
        "score": 0.9774112599286309
    },
    {
        "id": "751b8905-ddec-4940-9b29-afb80468af2f",
        "title": "Russian forces strike civilian infrastructure in Poltava Oblast , one person killed",
        "date": "2024-04-08T22:15:00+00:00",
        "url": "https://www.yahoo.com/news/russian-forces-strike-civilian-infrastructure-193345461.html",
        "message": "The Russian troops struck the civilian infrastructure in Poltava hromada, Poltava Oblast, on the evening of 8 April [a hromada is an administrative unit designating a town, village or several villages and their adjacent territories – ed.].\nSource: Filip Pronin, Head of Poltava Oblast Military Administration; the Ukrainian Air ForceQuote: \"The enemy struck the civilian infrastructure in Poltava hromada.\nDetails: At 21:07 the Ukrainian Air Force reported about a missile headed towards Poltava Oblast from the east.\nUpdated at 22:31: Pronin reported that a person was killed in the attack.\nAt 23:26, Pronin reported that the number of casualties had risen to 10.",
        "classification": "security",
        "score": 0.975484785640421
    },
    {
        "id": "359da833-cec4-4491-aca0-5c2975d4f6eb",
        "title": "Netanyahu spokesperson on Iran threat :  We dont seek war but will  do whatever it takes to defend ourselves  ",
        "date": "2024-04-07T17:30:00+00:00",
        "url": "https://www.yahoo.com/news/netanyahu-spokesperson-iran-threat-don-153405611.html",
        "message": "Tal Heinrich, a spokesperson for Israeli Prime Minister Benjamin Netanyahu, emphasized Israel is not seeking a war with Iran but will do “whatever it takes” to defend itself after Tehran vowed revenge for an alleged Israeli strike on the Iranian Embassy in Syria.\nAn alleged Israeli strike on the Iranian Consulate next to Tehran’s Embassy in Damascus, Syria, killed a senior commander overseeing Iranian military activity in Syria and Lebanon, along with another top general and five officers.\n“We will defend ourselves, whenever it takes, whatever it takes.\nAbout 250 others were taken hostage and about 100 are believed to still be alive in captivity in Gaza.\nIsrael quickly launched a retaliatory bombardment of Gaza, which has been ruled by the Gaza Strip since 2007, in a vow to destroy Hamas.",
        "classification": "security",
        "score": 0.9807594962122436
    },
    {
        "id": "8bb64ee4-7cba-4477-8af8-e53b28e655ad",
        "title": "Iran Foreign Minister Accuses U . S . of Giving Israel  Green Light  to Attack Consulate in Syria",
        "date": "2024-04-08T17:45:00+00:00",
        "url": "https://www.usnews.com/news/world/articles/2024-04-08/irans-foreign-minister-accuses-u-s-of-giving-israel-green-light-to-attack-consulate-in-syria",
        "message": "DAMASCUS, Syria (AP) — Iran's foreign minister Monday accused the United States of giving Israel the “green light” for a strike on its consulate building in Syria that killed seven Iranian military officials including two generals.\nSince the war in Gaza began six months ago, clashes have increased between Israel and Lebanon's Hezbollah.\nIsrael, which rarely acknowledges strikes against Iranian targets, said it had no comment on the strike in the Syrian capital.\nIsrael considers Hezbollah its most serious immediate threat, estimating it has some 150,000 rockets and missiles, including precision-guided missiles that can hit anywhere in Israel.\nMatters worsened Monday when the Lebanese military announced the death of a Lebanese Forces local official who had been kidnapped a day earlier in northern Lebanon.",
        "classification": "security",
        "score": 0.9212245816647991
    },
    {
        "id": "0add0899-3dfb-4fa4-a459-2aa1e16182ba",
        "title": "Biden ally opposes halting US weapons transfers to Israel",
        "date": "2024-04-08T11:15:00+00:00",
        "url": "https://www.jpost.com/international/article-795929",
        "message": "A Senate ally of President Joe Biden said the US should continue sending weapons to Israel, rejecting a call by House members to withhold arms transfers pending a full investigation into the Israeli missile strike that killed seven World Central Kitchen aid workers in Gaza.\nSenator Chris Coons, a Democrat from Delaware, cited a heightened risk of an attack by Iran or its proxies after a strike on an Iranian consulate in Syria that Iran blamed on Israel.\nBiden has come under renewed pressure to restrict US support for Israel after the aid workers, including a US-Canadian dual national, were killed last week.\nIn the six months since Hamas militants attacked Israel, parts of Gaza have been bombed to rubble.\nAt least 33,000 Palestinians have died, according to the health ministry, which Hamas runs, designated a terrorist organization by the US and European Union.",
        "classification": "world",
        "score": 0.623596629481012
    },
    {
        "id": "d92223f5-7596-4dba-bafa-7eab7c6b4a8c",
        "title": "Iran foreign minister accuses U . S . of giving Israel  green light  to attack consulate in Syria",
        "date": "2024-04-08T18:00:00+00:00",
        "url": "https://abcnews.go.com/International/wireStory/irans-foreign-minister-accuses-us-giving-israel-green-109002067",
        "message": "Iran’s foreign minister has accused the United States of giving Israel the “green light” for a strike on its consulate building in Syria that killed seven Iranian military officials, including two generalsDAMASCUS, Syria -- Iran's foreign minister Monday accused the United States of giving Israel the “green light” for a strike on its consulate building in Syria that killed seven Iranian military officials including two generals.\nSince the war in Gaza began six months ago, clashes have increased between Israel and Lebanon's Hezbollah.\nIsrael, which rarely acknowledges strikes against Iranian targets, said it had no comment on the strike in the Syrian capital.\nIsrael considers Hezbollah its most serious immediate threat, estimating it has some 150,000 rockets and missiles, including precision-guided missiles that can hit anywhere in Israel.\nMatters worsened Monday when the Lebanese military announced the death of a Lebanese Forces local official who had been kidnapped a day earlier in northern Lebanon.",
        "classification": "security",
        "score": 0.9263142424117009
    },
    {
        "id": "5c00fd6a-82f1-48eb-aee3-0582415d89f2",
        "title": "Iran foreign minister accuses U . S . of giving Israel  green light  to attack consulate in Syria",
        "date": "2024-04-08T19:30:00+00:00",
        "url": "https://www.pbs.org/newshour/politics/irans-foreign-minister-accuses-u-s-of-giving-israel-green-light-to-attack-consulate-in-syria",
        "message": "DAMASCUS, Syria (AP) — Iran’s foreign minister Monday accused the United States of giving Israel the “green light” for a strike on its consulate building in Syria that killed seven Iranian military officials including two generals.\nSince the war in Gaza began six months ago, clashes have increased between Israel and Lebanon’s Hezbollah.\nIsrael, which rarely acknowledges strikes against Iranian targets, said it had no comment on the strike in the Syrian capital.\nInitially after the strikes, Iranian state media said Zahedi led the Quds Force in Lebanon and Syria until 2016.\nIsrael considers Hezbollah its most serious immediate threat, estimating it has some 150,000 rockets and missiles, including precision-guided missiles that can hit anywhere in Israel.",
        "classification": "security",
        "score": 0.8272131668252288
    },
    {
        "id": "0e9cbf2a-013d-4066-b709-f7c511e232e5",
        "title": "Update : Newton police find suspect vehicle , driver after woman killed in hit - and - run crash",
        "date": "2024-04-09T01:30:00+00:00",
        "url": "https://www.kwch.com/2024/04/08/update-newton-police-find-suspect-vehicle-driver-after-woman-killed-hit-and-run-crash/",
        "message": "NEWTON, Kan. (KWCH) - Update: The City of Newton confirmed that police located the vehicle and driver suspected in the hit-and-run crash Monday morning that killed 64-year-old Laurie Robinson.\nUpdate: The Newton Police Department has identified a pedestrian killed Monday morning in a hit-and-run crash as 64-year-old Laurie Robinson, of Newton.\nA pedestrian was killed in a hit-and-run crash Monday morning on Southeast 24th Street just east of I-135 in Newton.\nThe vehicle is believed to have come over the 24th Street bridge to strike the woman, knocking her down the embankment.\nThey’re urging the driver of the involved vehicle to turn themselves in and ask anyone with information regarding the crash to contact Newton Police.",
        "classification": "security",
        "score": 0.9567788828240561
    },
    {
        "id": "6ebd9cd7-efb1-447e-82a9-9bacf48dbd6c",
        "title": "Iran foreign minister accuses U . S . of giving Israel  green light  to attack consulate in Syria",
        "date": "2024-04-08T18:00:00+00:00",
        "url": "https://apnews.com/article/syria-iran-israel-hezbollah-lebanon-consulate-amirabdollahian-68c7a652c5434d80fbff47e0ddbdd483",
        "message": "DAMASCUS, Syria (AP) — Iran’s foreign minister Monday accused the United States of giving Israel the “green light” for a strike on its consulate building in Syria that killed seven Iranian military officials including two generals.\nSince the war in Gaza began six months ago, clashes have increased between Israel and Lebanon’s Hezbollah.\nIsrael, which rarely acknowledges strikes against Iranian targets, said it had no comment on the strike in the Syrian capital.\nIsrael considers Hezbollah its most serious immediate threat, estimating it has some 150,000 rockets and missiles, including precision-guided missiles that can hit anywhere in Israel.\nMatters worsened Monday when the Lebanese military announced the death of a Lebanese Forces local official who had been kidnapped a day earlier in northern Lebanon.",
        "classification": "security",
        "score": 0.9218405119318567
    },
    {
        "id": "f2274aa9-f810-498a-a2a9-584fd08148ce",
        "title": "Iran not using Hezbollah to respond to Syria strike out of fear of proxy  destruction  | World | News",
        "date": "2024-04-07T23:00:00+00:00",
        "url": "https://www.express.co.uk/news/world/1884945/iran-hezbollah-israel-syria-strike-response",
        "message": "\"[It] will likely force a restructuring of both the Iranian strategy and its compartmentalizing of intelligence and logistics\" Iran provides money and weapons to Hezbollah, as well as Hamas and other Palestinian militant groups fighting Israel in Gaza.\nClashes between Israel and Hezbollah along the Israeli-Lebanese border have increased since the war in Gaza began nearly six months ago.\nIran’s Supreme National Security Council, a key decision-making body, met late on Monday and decided on a “required” response to the strike, Iran’s state television reported.\nIt said the meeting was chaired by President Ebrahim Raisi but provided no further details.\nSUBSCRIBE Invalid email We use your sign-up to provide content in ways you've consented to and to improve our understanding of you.",
        "classification": "security",
        "score": 0.6172574455857597
    },
    {
        "id": "0c714af9-5abe-421c-a0d4-0b7a920daa12",
        "title": "Iran Foreign Minister Accuses US of Giving Israel  Green Light  to Attack Consulate in Syria",
        "date": "2024-04-08T20:15:00+00:00",
        "url": "https://www.military.com/daily-news/2024/04/08/irans-foreign-minister-accuses-us-of-giving-israel-green-light-attack-consulate-syria.html",
        "message": "DAMASCUS, Syria — Iran's foreign minister Monday accused the United States of giving Israel the “green light” for a strike on its consulate building in Syria that killed seven Iranian military officials including two generals.\nSince the war in Gaza began six months ago, clashes have increased between Israel and Lebanon's Hezbollah.\nIsrael, which rarely acknowledges strikes against Iranian targets, said it had no comment on the strike in the Syrian capital.\nInitially after the strikes, Iranian state media said Zahedi led the Quds Force in Lebanon and Syria until 2016.\nIsrael considers Hezbollah its most serious immediate threat, estimating it has some 150,000 rockets and missiles, including precision-guided missiles that can hit anywhere in Israel.",
        "classification": "security",
        "score": 0.8223791205154777
    },
    {
        "id": "93432ea2-9940-4e18-a1e4-2f889f2790b8",
        "title": "Cameron says support for Israel  not unconditional  as Sunak calls for cease - fire",
        "date": "2024-04-07T18:15:00+00:00",
        "url": "https://www.upi.com/Top_News/World-News/2024/04/07/cameron-says-support-israel-not-unconditional/1611712510927/",
        "message": "British Foreign Secretary David Cameron on Sunday warned his country's support for Israel is 'not unconditional' after aid workers will killed in an Israeli airstrike last week.\nFile Photo by Andy Rain/EPA-EFEApril 7 (UPI) -- British Prime Minister Rishi Sunak called for a humanitarian cease-fire in Gaza on Sunday as Foreign Minister David Cameron said British support for Israel is \"not unconditional.\"\nThis must never happen again,\" Cameron wrote, while emphasizing that the conflict started when Hamas attacked Israel on Oct. 7.\n\"We continue to stand by Israel's right to defeat the threat from Hamas terrorists and defend their security,\" Sunak said in his statement.\nSunak said the \"hostages must be released\" as he stressed that Israel needs to allow more aid to be delivered to people in Gaza.",
        "classification": "security",
        "score": 0.46176539896244656
    },
    {
        "id": "6b24a034-120b-4d3c-a785-bc980917be4b",
        "title": "Iran foreign minister accuses U . S . of giving Israel  green light  to attack consulate in Syria",
        "date": "2024-04-08T21:15:00+00:00",
        "url": "https://www.clickondetroit.com/news/world/2024/04/08/irans-foreign-minister-accuses-us-of-giving-israel-green-light-to-attack-consulate-in-syria/",
        "message": "Iran's foreign minister Monday accused the United States of giving Israel the \"green light\" to strike its consulate building in Syria that killed seven Iranian military officials including two generals.\n(Syrian Presidency Telegram page via AP)DAMASCUS – Iran's foreign minister Monday accused the United States of giving Israel the “green light” for a strike on its consulate building in Syria that killed seven Iranian military officials including two generals.\nSince the war in Gaza began six months ago, clashes have increased between Israel and Lebanon's Hezbollah.\nIsrael considers Hezbollah its most serious immediate threat, estimating it has some 150,000 rockets and missiles, including precision-guided missiles that can hit anywhere in Israel.\nMatters worsened Monday when the Lebanese military announced the death of a Lebanese Forces local official who had been kidnapped a day earlier in northern Lebanon.",
        "classification": "security",
        "score": 0.9273631828704976
    },
    {
        "id": "39296d20-9edc-44c6-a5ec-9ca6bc21012d",
        "title": "Iran foreign minister accuses U . S . of giving Israel  green light  to attack consulate in Syria",
        "date": "2024-04-08T21:15:00+00:00",
        "url": "https://www.local10.com/news/world/2024/04/08/irans-foreign-minister-accuses-us-of-giving-israel-green-light-to-attack-consulate-in-syria/",
        "message": "Iran's foreign minister Monday accused the United States of giving Israel the \"green light\" to strike its consulate building in Syria that killed seven Iranian military officials including two generals.\n(Syrian Presidency Telegram page via AP)DAMASCUS – Iran's foreign minister Monday accused the United States of giving Israel the “green light” for a strike on its consulate building in Syria that killed seven Iranian military officials including two generals.\nSince the war in Gaza began six months ago, clashes have increased between Israel and Lebanon's Hezbollah.\nIsrael considers Hezbollah its most serious immediate threat, estimating it has some 150,000 rockets and missiles, including precision-guided missiles that can hit anywhere in Israel.\nMatters worsened Monday when the Lebanese military announced the death of a Lebanese Forces local official who had been kidnapped a day earlier in northern Lebanon.",
        "classification": "security",
        "score": 0.9273631828704976
    },
    {
        "id": "9c3f4dbd-b0a2-456a-9ec1-d5bed03062ae",
        "title": "Biden Ally Opposes Halting US Weapons Transfers To Israel",
        "date": "2024-04-08T05:45:00+00:00",
        "url": "https://menafn.com/1108069062/Biden-Ally-Opposes-Halting-US-Weapons-Transfers-To-Israel",
        "message": "(MENAFN- Live Mint) \" (Bloomberg) -- A Senate ally of President Joe Biden said the US should continue sending weapons to Israel, rejecting a call by House members to withhold arms transfers pending a full investigation into the Israeli missile strike that killed seven World Central Kitchen aid workers in Gaza.\nBiden has come under renewed pressure to restrict US support for Israel after the aid workers, including a US-Canadian dual national, were killed last week.\nRead more: Iran Tells US to Step Aside as It Readies Response to Israel In the six months since Hamas militants attacked Israel, parts of Gaza have been bombed to rubble.\nAt least 33,000 Palestinians have died, according to the health ministry, which is run by Hamas, designated a terrorist organization by the US and European Union.\n(Updates with House speaker's comments in final two paragraphs.)",
        "classification": "world",
        "score": 0.6639826158785307
    },
    {
        "id": "3b02b6e9-ecd0-4913-a5bc-d0f22729ae25",
        "title": "Iranian General Warns That No Israeli Embassy Is Safe - News From Antiwar . com",
        "date": "2024-04-08T03:15:00+00:00",
        "url": "https://news.antiwar.com/2024/04/07/iranian-general-warns-that-no-israeli-embassy-is-safe/",
        "message": "Israel is preparing for a potential Iranian response to the bombing of Iran's consulate in DamascusAn Iranian general warned on Sunday that no Israeli embassy is safe as Israel is preparing for a potential Iranian response to its bombing of Iran’s consulate in Syria.\nSafavi appeared to be referring to Israeli media reports that said 28 Israeli embassies and consulates have been temporarily closed due to fears of an Iranian attack.\nThe Israeli bombing of Iran’s consulate killed 13 people, including a senior Iranian general and six other members of the Islamic Revolutionary Guard Corps (IRGC).\nUS officials told NBC News that they are concerned Iran might be planning to hit targets inside Israel or an Israeli consulate building in the region.\nOn Friday, Mohammad Jamshidi, an aide to Iranian President Ebrahim Raisi, said Tehran told the US not to get involved if Iran responds.",
        "classification": "security",
        "score": 0.8492690248803119
    },
    {
        "id": "ae9350e6-b30c-4e12-baf9-ed0d98f871eb",
        "title": "Iran foreign minister accuses U . S . of giving Israel  green light  to attack consulate in Syria",
        "date": "2024-04-08T17:45:00+00:00",
        "url": "https://www.clickorlando.com/news/world/2024/04/08/irans-foreign-minister-accuses-us-of-giving-israel-green-light-to-attack-consulate-in-syria/",
        "message": "Iran's foreign minister Monday accused the United States of giving Israel the \"green light\" to strike its consulate building in Syria that killed seven Iranian military officials including two generals.\n(Syrian Presidency Telegram page via AP)DAMASCUS – Iran's foreign minister Monday accused the United States of giving Israel the “green light” for a strike on its consulate building in Syria that killed seven Iranian military officials including two generals.\nSince the war in Gaza began six months ago, clashes have increased between Israel and Lebanon's Hezbollah.\nIsrael considers Hezbollah its most serious immediate threat, estimating it has some 150,000 rockets and missiles, including precision-guided missiles that can hit anywhere in Israel.\nMatters worsened Monday when the Lebanese military announced the death of a Lebanese Forces local official who had been kidnapped a day earlier in northern Lebanon.",
        "classification": "security",
        "score": 0.9273631828704976
    },
    {
        "id": "e90de36f-ab52-48f8-b735-6c1931537b7c",
        "title": "Newton woman killed in hit - and - run crash , search for suspect vehicle continues",
        "date": "2024-04-08T20:30:00+00:00",
        "url": "https://www.kwch.com/2024/04/08/woman-killed-hit-and-run-crash-newton/",
        "message": "NEWTON, Kan. (KWCH) - Update: The City of Newton confirmed that police located the vehicle and driver suspected in the hit-and-run crash Monday morning that killed 64-year-old Laurie Robinson.\nUpdate: The Newton Police Department has identified a pedestrian killed Monday morning in a hit-and-run crash as 64-year-old Laurie Robinson, of Newton.\nA pedestrian was killed in a hit-and-run crash Monday morning on Southeast 24th Street just east of I-135 in Newton.\nThe vehicle is believed to have come over the 24th Street bridge to strike the woman, knocking her down the embankment.\nThey’re urging the driver of the involved vehicle to turn themselves in and ask anyone with information regarding the crash to contact Newton Police.",
        "classification": "security",
        "score": 0.9567788828240561
    },
    {
        "id": "62b5bdc7-8e29-41f1-b2f5-2751ccc1e2d2",
        "title": "Israel kills  Hezbollah field commander  in Lebanon",
        "date": "2024-04-08T10:45:00+00:00",
        "url": "https://www.middleeastmonitor.com/20240408-israel-kills-hezbollah-field-commander-in-lebanon/",
        "message": "An Israeli strike on southern Lebanon early this morning killed a Hezbollah field commander, as the United Nations warned that shelling was spreading and urged a halt to the violence, Reuters reports.\nEarly today, Israeli fighter jets hit the village of Al-Sultaniyah and killed a field commander in Hezbollah’s elite Radwan units and two other people, the Israeli military and two Lebanese security sources said.\nThe Israeli military identified the commander as Ali Ahmed Hassin, and said he was responsible for planning and executing attacks against Israelis.\nIsraeli strikes have killed around 270 Hezbollah fighters in the last six months as well as around 50 civilians, including children, medics and journalists.\nThe shelling has displaced tens of thousands on each side and hit the farming economy in southern Lebanon particularly hard, with bombed-out fields left unplanted or unharvested.",
        "classification": "security",
        "score": 0.9699919468572042
    },
    {
        "id": "729662ba-92f1-4a8a-8211-da2752a0c698",
        "title": "Australia names special adviser for probe into Gaza aid worker deaths",
        "date": "2024-04-08T05:00:00+00:00",
        "url": "https://www.todayonline.com/world/australia-names-special-adviser-probe-gaza-aid-worker-deaths-2399071",
        "message": "SYDNEY — Australia on Monday (April 8) tasked a former military chief with monitoring Israel's probe into the deaths of seven aid workers in Gaza, seeking \"full accountability\" for the killings.\nAustralian national Lalzawmi \"Zomi\" Frankcom was among the group of World Central Kitchen volunteers killed last week in an Israeli air strike.\nIsrael's military said it had fired two officers in the aftermath, but its attempts to explain have done little to curb international outrage.\nOn Monday she appointed retired defence force chief Mark Binskin as a special adviser working with Israel's military on continuing investigations.\nThe group included 43-year-old Australian national Frankcom, as well as British, Palestinian, Polish and US-Canadian employees.",
        "classification": "security",
        "score": 0.786884275624402
    },
    {
        "id": "3efe7c46-5ef7-4852-b5ec-a07881a4fc28",
        "title": "IDF Kills Hamas  Emergency Committee  Leader in Central Gaza",
        "date": "2024-04-09T14:45:00+00:00",
        "url": "https://www.newsmax.com/world/globaltalk/idf-hamas-gaza/2024/04/09/id/1160260/",
        "message": "An Israeli air strike on Monday night killed a top Hamas terrorist, who headed the organization's \"emergency committee\" in the camps of central Gaza.\nHatem Alramery \"was a Hamas military-wing operative in the field of projectile launches within the Maghazi Battalion of the Central Camps,\" according to the IDF.\nIsraeli forces are conducting targeted attacks in Khan Yunis after nearly all ground forces withdrew from the southern Gaza Strip on Sunday following four months of fighting in the former Hamas stronghold city.\n\"Throughout the past day, the IAF also struck and destroyed military compounds, launch posts, and numerous terrorist infrastructure sites throughout the Gaza Strip,\" the military said.\nIn the central Strip, troops killed several terrorists in close-quarter combat and other terrorists were eliminated in air strikes and by sniper fire.",
        "classification": "security",
        "score": 0.9873284289440893
    },
    {
        "id": "fa844b15-0fdc-481c-a73f-f2dbce41f4ab",
        "title": "Israeli military says strike killed a Hezbollah commander",
        "date": "2024-04-08T09:45:00+00:00",
        "url": "https://www.voanews.com/a/israeli-military-says-strike-killed-a-hezbollah-commander/7560911.html",
        "message": "Israel’s military said Monday it carried out an airstrike in southern Lebanon that killed a Hezbollah commander who had conducted multiple attacks targeting northern Israel.\nAn Israeli military statement identified the commander as Ali Ahmad Hassin of Hezbollah’s Radwan Force.\nCross-border attacks by Israeli forces and Hezbollah militants have been common throughout Israel’s six-month-old war against Hezbollah ally Hamas in the Gaza Strip.\nAlso Monday, the Israeli military said it carried out an airstrike in the Khan Younis area of southern Gaza in response to multiple rocket launches.\nThe Israeli military says that the total includes thousands of militants it has killed.",
        "classification": "security",
        "score": 0.9971041392506058
    },
    {
        "id": "c20b6324-4494-41cc-8e86-f5dc93db4825",
        "title": "Israel embassy security raised after Iran  not safe  threat | Delhi News",
        "date": "2024-04-08T04:00:00+00:00",
        "url": "https://timesofindia.indiatimes.com/city/delhi/israel-embassy-security-raised-after-irans-not-safe-threat/articleshow/109118747.cms",
        "message": "NEW DELHI: Security was stepped up around the Israeli embassy in Delhi after a top Iranian military adviser on Sunday warned Israel that none of its embassies was safe following last week's strike in Damascus that was blamed on Israel.Two Iranian generals were killed in the attack .\nIsrael embassy in Delhi has already witnessed two incidents in 2012 and '23 where its embassy or staffers were targets.Intel agencies have asked local law enforcement units to step up vigil around Jewish establishments, community centres/Chabad Houses in Delhi and Mumbai.\nPolice also ramped up security measures across key transit points in the city, including railway stations and the airport.",
        "classification": "security",
        "score": 0.5257671057363533
    },
    {
        "id": "cee143cf-9607-48da-a08a-66f2a821a4a7",
        "title": "Israel  can handle  any threat from Iran , says military chief",
        "date": "2024-04-07T20:30:00+00:00",
        "url": "https://www.bbc.co.uk/news/world-middle-east-68757080",
        "message": "But an unnamed senior Israeli official told Reuters news agency that those killed had \"been behind many attacks on Israeli and American assets and had plans for additional attacks\".\nThey also insisted that the embassy \"was not a target\".",
        "classification": "security",
        "score": 0.941435535258871
    }
]